{
  "1": {
    "topic": "CHANGE OF STATUS",
    "bibleReference": "Genesis 41:14, 33-44",
    "prayer": "My head is fit for crowning",
    "text": "It is with joy and gladness that we welcome you to the month of April. For some, April is the month of fools. But for us in this House, it is our month of CHANGE OF STATUS! A fool says in his heart that there is no God. We are not fools. We know there is a God who made the heaven and the earth. He is the Owner of the breath in our nostrils. He orders the entire universe. He is the One we call the Great God of Agape. He is our loving father who is all things to us. If we have anything to show in life, we owe it to our God. May His name be praised for ever in lives.\n\nToday, we see how the status of Joseph changed, as it were, in a twicle of an eye! He woke up a prisoner; bathed and dressed as a prisoner. He was probably up and going about his duties as a prisoner when the message came that he was wanted in the palace. We decree today, your word shall come this month in Jesus’ name. That message, whether by letter, Short Message Service, WhatsApp or e-mail that will change your status for the better shall come your way very soon in Jesus’ name. That long awaited lifting shall be yours without further delay.Yes. Joseph’s word came and he became what he became. But it didn’t just come. Joseph pressed some buttons. He was a dreamer. He had a vision of where he was going in life and destiny. He did not allow temporary setbacks of sibling rivalry, slavery and imprisonment block his vision. He served his masters faithfully. He used his God-given talents to the glory of God. He lived in righteousness all along. When his word came, he didn’t go to the palace like a prisoner. He shaved and dressed up for where he was going.Do you desire a higher status or a better place in destiny? Go and study Joseph. Follow his principles and leave the rest for God. Your change of status is imminent. Be on the look-out, your word shall soon come. It will no longer tarry. Do have a beautiful month."
  },
  "2": {
    "topic": "PAY ATTENTION TO THE KINGDOM",
    "bibleReference": "Mathew 6:25-34",
    "text": "Today’s text can be summarized in two sentences: Stop worrying yourself about the things that trouble the people of the world. Rather pay attention to the Kingdom of God and God will take care of you.As a child of God, this should be your anchor word. The Almighty God has decided to make you His Priority. It is you before anybody or anything else. You will enjoy God this season more than ever before. He will help you and the whole world will know it and marvel. Remember, you are the apple of His eyes.\n\nYou are not a second-class citizen. You are the first and the only option He has. He will attend to you. You will be a wonder to yourself and to your generation. But there is a condition. Seek ye first the Kingdom of God and its righteousness! In other words, pay attention to the kingdom. Two things are expected of you here.\n\n Make the kingdom your own priority and live a righteous life. This should be your season of kingdom addiction. Everything about you must be about the kingdom of God. You must live it, breathe it; walk it; talk it and celebrate it. You must be fanatical about the kingdom every day. It should be number one on your priority list. \n\n How do you do this? First, you must work on your relationship with God, the King. Get very personal with Him. Ensure your salvation is really secured. Repent of your sins and do not go back to them. Create time for God. Walk with Him. Don’t joke with fellowship. Let your local assembly feel your impact. Be a pillar there. Join a working team. Be a kingdom financier. Be an asset to the Kingdom. Remember, stop worrying about the things that worry the world. Let God do the worrying for you.",
    "prayer": "Lord, I receive grace to make the kingdom my priority"
  },
  "3": {
    "topic": "SAME INPUT, DIFFERENT OUTPUTS",
    "bibleReference": "Mathew 13:1-232",
    "text": "The Lord Jesus Christ gave several parables to illustrate the kingdom. Among the most popular is the Parable of the Sower. There are three principal issues in the parable – the sower, the seed and the soil. The sower sowed the seed on different types of soil and there were different types of result. Please note that it was the same sower with the same seed. But the results were different. The quality of the seed was the same. We want to assume that the weather condition was equally the same, but the harvest differed from soil to soil.\nThe situation is still the same today. The same word is preached in the House of God and it produces different results in people’s lives. In some lives it is like the word is not delivered! In some, the word produced a result for a certain season and then disappears! In yet some other lives, you see enduring results. Even among these, there are levels. Some are thirtyfold; some are sixtyfold while some are a hundredfold.\nPrecious child of God, have you ever wondered why people sit under the same word and ministration every day and service and yet don’t prosper the same way and level? The Sower is not to blame. The seed is good. But the soil is responsible for the harvest. Precious child of God, you need to work on the soil of your heart if the word must produce for you. Like any soil, your heart must be cultivated. Take out the weeds and the thorns. Harrow the soil. Water it constantly with the word of God. Apply the fertilizer of faith (Hebrews 4:2) and you will see great results.",
    "meditation": "What is the condition of my heart? Am I positioned to perform by the word that I hear constantly?"
  },
  "4": {
    "topic": "SLEEP NOT",
    "bibleReference": "Mathew 13: 24-43",
    "text": "In his teachings, Jesus used imagery familiar to the audience. They were predominantly farmers and could understand easily. In today’s parable, Jesus illustrated what happens in certain lives. After a careful and diligent labour, you find out that tares just spring out on the field and you wonder “How come? Tares don’t just appear. Someone sows them. “An enemy did this while men slept!” our Lord explained. According to the Lord Jesus, this parable speaks holistically about the kingdom of God through the ages and the end of times when the harvest of the world would come. Nevertheless, the illustration is also applicable to individual lives today.\n As a believer, vigilance is essential. You must watch and pray. If you sleep, tares will be sown in your field. Your field represents your life, your home, your children, your profession, your education, your ministry or whatever else you labour on. When the results differ from the expected, there must be tares somehow. You must watch out. Don’t give room for the devil; he is the sower of tares.\n Please note that the word you received is your seed. Your life is the field. Whatever external influence that runs contrary to the seed and its purpose in your life is the enemy.  When you hear the word or conceive a God given vision, what do you do? Who do you discuss with? Do you place it side by side with the conditions of the environment? Are the suggestions of your friends or the economic situation around you more convincing than the word of God? You must watch out for the sower of tares and stop him from sowing into your life. Stop sleeping. Watch over your seed or else!",
    "prayer": "Lord I receive the grace for watchfulness. I shall not sleep the sleep of death."
  },
  "5": {
    "topic": "INVALUABLE TREASURE",
    "bibleReference": "Mathew 13:44-45",
    "text": "Two parables or illustrations are given here. The Lord likens the kingdom to a treasure hidden in the field. When a man found it, he sold all he had to purchase the field so he could possess the treasure. In the second illustration, a man in search of pearls found one of great value. He went and sold everything he possessed to acquire the pearls. \nSeveral things are to be noted here. Number one, the kingdom is not cheap. It is not common. Peter said it this way:\n \n “For you know that it was not with perishable things just as silver or gold that you were redeemed from the empty way of life handed down to you from your forefathers, but with the precious blood of Christ, as of a Lamb without blemish or defect” 1 Peter 1:18-19 (NIV). \n Salvation is not cheap. The price was high. Therefore, the Kingdom must be cherished. In the second instance, the kingdom is hidden. It must be sought, found and laid hold upon. It is not for every Tom, Dick and Harry. It is for conscious and deliberate seekers. Finally, the value of the kingdom is above anything and everything else a man may possess. Therefore, you must sell all to possess it. What this means is that the value you place on your salvation, your relationships with the Lord and the Kingdom must be higher than what you place on anything or anyone else. \nThe Kingdom must be your priority. It must be second to nothing in your life. To really possess the Kingdom, you need to sell all - property, relationship, time and everything, to possess the kingdom. This means, everything else must take second place after the kingdom. There must not be something dearer to you than the kingdom. It is of a great value.",
    "meditation": "He that loveth Father or mother more than me is not worthy of me: and he that loveth son or daughter more than me is not worthy of me. Mathew 10:37"
  },
  "6": {
    "topic": "THE KINGDOM IS A LIVING ORGANISM",
    "bibleReference": "Mathew 13:31-33",
    "text": "The kingdom of God is not an organization. No! It is a living organism. In basic science, we are taught that one of the characteristics of a living thing is that it grows. The kingdom is not static! It grows by the day. It grows in size, strength and influence. It does not matter how small when it starts, give it time, the church would soon become a strong force to be reckoned with. Consider this. After Jesus was crucified, there were very few disciples left. In fact, there were only 120 disciples on the day of Pentecost. From that number, the kingdom spread to thousands in Jerusalem, Judea, and Samaria and now to the uttermost parts of the world. \n Over the ages – through more than two millennia of history, the church has gone through all sorts of persecutions, turbulence, wars and what not; yet it not only survived, it grew in multiple dimensions. Today, like the mustard seed in the parable, it is a mighty tree, a shelter and a place of refuge for billions of believers all over the world and it is still growing.\n The issue here is that it does not just grow and expands automatically. People must work at it. Believers must make believers of other people. The kingdom grows when you and I witness to others and they yield their lives to Jesus. This season, and even for the rest of your life, you must not keep quiet. Speak to someone about Christ. Witness to that friend, that colleague, boss or subordinate; that business partner, that neighbour and that fellow passenger. Why should they perish and you have their blood on your head? \n Our kingdom grows and expands through peaceful means. Ours is the Gospel of Peace. Our king is the Prince of Peace. Be an ambassador. Contribute your quota to the growth and expansion of your Father’s Kingdom. Let not a day go without you preaching to somebody. The kingdom must not end with you.",
    "prayer": "I receive the grace to be an effective witness contributing to the growth of the kingdom.",
    "meditation": "Soul Winning is my priority"
  },
  "7": {
    "topic": "A LARGE HOUSE",
    "bibleReference": "MATTHEW 13:47-50",
    "text": "In this parable, the Lord likens the Kingdom to a net thrown into the sea to catch fish. It is a given that all sorts of fish: good and bad, small and big, wanted and unwanted will find their way into the net. It is the responsibility of the fisherman to sort out the ones he wants from those not needed. While he would preserve the needed ones, the others would be cast away.\n\nThe parable depicts the Church. All through the ages, even from the time of our Lord here on earth, we found all sorts of people in the Church. As there were honest, sincere and devoted children of God in the Church, there are also men of questionable character. The church comprises of diligent workers as well as lazy layabouts. It is an All Comers affair. This is why, you encounter some people and you appreciate God for their Christian lives and the church they belong to. It is also possible to find another set from the same church and by their character, you wonder, are these Christians at all? Well, as the saying goes, there are different kinds of children in God’s House. “But in a great house, there are not only vessels of gold and of silver, but also of wood and of earth; and some to honour, and some to dishonour. If a man therefore purge himself from these, he shall be a vessel unto honour, sanctified, and meet for the master’s use and prepared unto every good work. 2 Timothy 2:20-21 \n\nHow relevant is this parable to you as an individual? Firstly, you must note that the net would accommodate all fish until the time of decision when the fisher would sort the good from the bad. This should also tell you that pretext can only be for a while and that there will be a day of reckoning. One day will be one day! The Lord will reveal who are really His and who are not? His disciples will be with Him for ever in the Kingdom of His Father while others will be cast out into eternal damnation. The choice is yours. You must decide what kind of fish are you in the net!",
    "meditation": "The day of separation will come. When it does, where will I belong?"
  },
  "8": {
    "topic": "THE POWER OF PRAYERS",
    "bibleReference": "Psalm 65:1-13",
    "text": "O thou that hearest prayer, unto thee shall all flesh come. Psalm 65:2\n\n Our God is a living God. He is different from the other so called gods. He is alive and He gives breath to all living. One of the ways He demonstrates His life unto us is that He answers our prayers. Whether you pray alone in your closet or you pray with others openly in a congregation, He will always answer your prayers. It does not matter how many are praying at the same time or the diversity of requests in various languages, He can identify each person and his requests and answer accordingly. No wonder then that all flesh shall come to Him.\n\n Prayer is a great weapon in the hand of the believer. It is the way we communicate privately and corporately with our Maker. We worship Him and make our requests/supplications known unto Him in our prayers and He answers us. From today’s reading, we see various ways by which God answers prayers. He blesses us with good things in His house (vs 4). He answers us with awesome deeds of righteousness. (vs 5). He cares for our land and waters it (vs 9-10). He crowns our year with abundance (vs 11). These all are what we need to make it on planet earth and they come by prayer. \n\n The book of Psalms is a very powerful book on prayers. In the next few days, we shall explore the psalms for beautiful prayers and appropriate same into our lives.",
    "prayer": "Lord teach me how to pray"
  },
  "9": {
    "topic": "DEAR LORD, CONTEND WITH MY CONTENDERS",
    "bibleReference": "Psalm 35:1-20 ",
    "text": "There are some battles we fight that do not befit us as believers. This is because, in many instances, we do not have to engage in physical quarrels or engage in enmity with those who contend with us. It must be stated that as long as we are alive, there will always be contenders with us. Some are not happy that you are happy. Some want the exact thing you have or you want.\n\n Unfortunately, in many cases the contenders are neither peaceful nor godly. They do not mind hurting you or even killing you. This is why you must take steps to gain the upper hand. And this you can do in the place of prayers. Taking a cue from the Psalmist, please pray the following prayer points.”\n\n• Father Lord, in accordance with your word, contend with those who contend with me. \n\n • I decree disgrace and shame to the camp of those who seek my life (home, business etc) to destroy it.\n\n• I shall not fall prey to the teeth of the enemy\n\n• I shall not fall into the pit they dig for me\n\n• I decree that my enemy will be entangled in the net he spread for me and fall into his own pit.\n\n• Dear Lord, let there be always enough reasons for me to praise you.",
    "meditation": "Verses 10"
  },
  "10": {
    "topic": "FORGIVE ME O LORD",
    "bibleReference": "Psalm 51",
    "text": "You have just read one of the most popular and well quoted Psalms. It was written by David after Nathan confronted him on the sin of adultery and murder with the subsequent cover-up. He admitted his sin and pleaded for forgiveness. Many have said that the major difference between David and Saul was that David always admitted his fault while Saul would give excuses or blame others. Beloved, God expects and even empowers us to live above sin. No sinner can stand in His presence. But then in His mercy, God’s love makes provision for our mistakes because he knows our feeble frame.\n\nMy little children, these things write I unto you, that ye sin not. And if any man sin, we have an advocate with the Father, Jesus Christ the righteous: And he is the propitiation for our sins: and not for ours only, but also for the sins of the whole world.1 John 2:1-2\n\n You must not make a habit of sin. But if and when you sin, God expects you to confess and ask for forgiveness. And above all forsake it. The blood of Jesus is the propitiation for our sins. It cleanses from sin and the consequences of it.  The following prayers may help you.\n\n  • Worship God and appreciate Him for the forgiveness of sins.\n\n• Think deeply and do a checklist of your life before God.\n\n• Confess every known sin without passing the buck or giving excuses\n\n• Ask God for forgiveness\n\n• Plead the blood of Jesus for cleansing.\n\n• Ask for the grace to go and sin no more.\n\n• Give him thanks."
  },
  "11": {
    "topic": "SHAME IS NOT MY PORTION",
    "bibleReference": "Psalm 31",
    "text": "Shame is not a good experience. It is akin to disgrace and ridicule. It exposes people to mockery. When a man faces shame, people around taunt him and say “where is your God”? Shame comes knocking when you are not equal to your situation; when your mates have left you behind; when what should be in abundance is scarce; when you fall into the snare of the fowler; when it appears as if God has forsaken you; when you are empty when you should be full, when you “spend” complaints and excuses where you should spend money; and when the enemy gains the upper hand in your life.\n\n  If you are facing any of the aforementioned situations, you are getting out of it today. The pathway is easy. Once you have ensured that you are not the root cause of the situation by way of sin, all you need is prayer. Even if you are the cause, the antidote is still prayer. Let’s look at these prayer points from the experience of David in Psalm 31.\n\n• Lord deliver me speedily from the enemy too strong for me. (vs 2)\n\n• I shall not fall into the net they have spread for me (vs 4)\n\n• Help me to love what you love and hate what you hate so that I will not face shame (vs 6-7)\n\n• Have mercy on me in the time of trouble (vs 9)\n\n• I shall not spend my life in grief and reproach vs (10-12)"
  },
  "12": {
    "topic": "MY SOUL BLESSES THE LORD",
    "bibleReference": "Psalm 103",
    "text": "It is always good to praise the Lord. We do it because of who He is; what he does and how he treats us and for his promises.  One should sit back often and think about the goodness of the Lord. It is not all the time you approach the Lord that you should come with loads of requests. No. There should be occasions of praise only. At such a time, you go before Him and recount His goodness in your life. You remind Him of His great works and the mercy you have received. As you declare days of fasting and prayers, you can also declare days of fasting and praises.\n\n This is what the Psalmist did in our reading today. He chose to bless the Lord for several reasons. Why not take a cue from the psalmist and worship God before your outing today? These praise points may help.\n\n• Thank God for your salvation and the forgiveness of you sins.\n\n • Thank Him for redeeming you from destruction.\n\n • Thank Him for divine direction and leading.\n\n• Thank Him for not relating to you as your sins deserve but in mercy.\n\n• Thank Him for His fatherly care and for daily provisions.\n\nBeloved, put on a garment of praise. Let your praise always supersede your requests. God loves it for He inhabits the praise of His people. Let your life be His dwelling place."
  },
  "13": {
    "topic": "HELP ME O LORD",
    "bibleReference": "Psalm 109",
    "text": "Many times, one faces a situation that is beyond you. You find yourself helpless. There is nothing in your capacity you can do or say to redeem the situation. It could be that you face an enemy too strong for you or that the situation is so complex that your understanding or skill cannot handle. At such a time, you need help. All you need do is not keep quiet. Cry out for help. God is always there. Whenever you go to Him for help, He will help you, let us pray.\n\n•Dear Lord, enough is enough! Arise quickly to help me handle this matter (vs 1)\n\n•Deliver me from the mouth of the wicked (vs 2)\n\n•My good shall not bring a harvest of bad. Those I have helped shall not turn to become my adversaries (vs 4-5)\n\n•Lord deal with unrepentant adversaries of my life.\n\n•Lord keep my enemies occupied with trouble in their house to enable me enjoy peace in my domain.\n\n•Help me Lord. Show me mercy in all my doings\n\n•Thank you, Father, for being my help.",
    "meditation": "My help comes from the Lord."
  },
  "14": {
    "topic": "MY LIFE SHALL BE A WONDER ",
    "bibleReference": "Psalm 71",
    "text": "Whenever the Lord visits a people or a person, He does wonders. When he does His wonders, the people around wonder and the recipient(s) become a wonder. Before this year runs out, you will look at yourself and declare “I am God’s Wonder”. You are at Liberty to add “Wonder” to your list of names. Yes. Even if you don’t call yourself “Wonder”, people around you will add “Wonder” to your name. This is because God will be so good to you that all shall see it and marvel. He will do the extra-ordinary. He will do beyond your capacity. He will lift you.\nPrayer Points.\n\nBe my Rock and Fortress O Lord that I may not see any hurt (vs 3)\nDeliver me, O God from the hand of the wicked. Let them always fail regarding my case (vs 4)\nLet me carry the assurance of your presence till good old age (vs 9,12)\nLet there be confusion in the camp of my enemies.\nLet shame and dishonor be the portion of those seeking to hurt me (vs 13)\nFill my mouth with righteousness (vs 14-15)\nMake the totality of my life a Wonder to behold (vs 7)"
  },
  "15": {
    "topic": "MY EYES ARE ON YOU, O GOD",
    "bibleReference": "Psalm 42",
    "text": "The psalm for this morning is one of adoration. The psalmist decided to shift his gaze from the unpleasant happenings around and focus on God. He encouraged himself in the Lord his Maker. When he appeared overwhelmed with the circumstances around him, he longed for God and God only. He believed that if he could get God on his side, all shall be well. No wonder he chided himself saying:\n\n“Why art thou cast down, O my soul and why art thou disquieted in me? Hope thou in God; for I shall yet praise him for the help of his countenance (vs 5) \n\nHave you found yourself in a situation where it seems all is against you and things are not working as they should? In such times, you feel God is afar. Relax God is not far. He is very nearby. All you need is to draw near to him and he will draw near to you.\n\nLike the Psalmist, shift your focus from the troubles and gaze on your loving Father. When you turn to him, the issue at stake should not even be your focus. Rather, worship Him; adore Him; remind Him of His deeds in the past; His loving-kindness of old and thank Him for the strength and grace He has given you to survive the situation up till now. In doing so you are telling God; you are more important to me than what you do or do not do. Let your heart thirst for God come what may.",
    "prayer": "Go ahead with praise and worship"
  },
  "16": {
    "topic": "HIGHER HEIGHTS EVERY DAY",
    "bibleReference": "Psalm 61",
    "text": "No matter your achievement in Life, there is always a place called better. No matter your placement in life, there is always somewhere called higher. You shall get there in Jesus’ name. That place called higher and better represents where you aspire to and where you should be. You have tried and you are still endeavoring to get there. Our prayer is that you get there. \n\nBe that as it may, you cannot get there by your own strength. It is going to be by the Lord. He is the one who can and will lead you to the rock that is higher than you. He can do it every blessed day. Your tomorrow has to be better than your today. The word says the race is neither to the swift nor the battle to the strong. No, it is only by God. You shall rise by Him. He shall lift up your head as you pray with the psalmist.\n\nFather, hear my cry at all times and attend unto my prayer.\n\nYou Lord are the only one that can lift me. Lord I present my head for lifting.\n\nBe thou my strong shelter and strong tower from the enemies of my destiny.\n\nCover me with your wings and hide me in your tabernacle.\n\nGive me the heritage of those that fear your name. \n\nGive me long life./nLet mercy and truth be my portion.\n\nLet each day lead me to higher heights.\n\nLet your praise continually be on my lips."
  },
  "17": {
    "topic": "THE COVENANT IS MY HIDING PLACE",
    "bibleReference": "Psalm 89:1-4; 20-37",
    "text": "We are a people helped and blessed by God. We enjoy these by reason of the covenant that God has with us. He relates with us on the basis of the covenant. When all else fails, the covenant is a sure banker. The covenant preserved David’s Kingdom throughout the generations until the scattering of Israel. Even today, David still reigns in Israel. The National Flag of Israel is called the “Star of David”! This tells us that God does not joke with nor breaks His covenant. Do you want to be blessed by God in an enduring manner? Then do so by the way of the covenant. It will do you good to pray these covenant prayers from the life of David into your life.\n\nI receive divine establishment for me and my seed after me (vs 4)\n\nLet the anointing over my life continually be fresh and flourishing (vs 20)\n\nLord strengthen me against the enemies of my life. (vs 21-23)\n\nMy horn shall always be exalted. I shall not go down but up continually (vs 24).\n\nMy coast shall be enlarged (vs 25)\n\nI receive the inheritance of the first born (vs 27)\n\nI receive mercy and loving kindness of God for my seed after me (vs 28-30)/nFrom the storms of life, I hide in the Covenant./nThank God for He will not break His covenant."
  },
  "18": {
    "topic": "MY HELP COMES FROM ZION",
    "bibleReference": "Psalm 20:1-9",
    "text": "Zion is the House of God. It is a place of refuge for the believer. It is the House of Prayers and a place of praise. The Psalmist says praise waits for the Lord in Zion. It is a place where there is constant light. This means that illumination will always be available in Zion. In the sanctuary, you find his Shekinah glory. All these happen because of the presence of God in the sanctuary.\n\nBeloved, Zion is the place of help. You are aware that God is in the Sanctuary and He is the Helper of the helpless. He is the One who will help you from Zion. As long as you are committed to Zion, God is bound to help you. You cannot be stranded. No way. Help will always arise for you.\n\nFrom the scriptures, we find that the Lord always hear us in the day of trouble. His name will defend us. He would grant the desires of our heart and fulfil all our petitions. He will also serve us in critical times. You have an assurance that you will always arrive safely no matter how the journey may look. You cannot die by the hands of Robbers or from air-crash or road or rail accident. He will send you timely help.\n\nThe secret of the help is in verse 7. Don’t put your trust in the strength of man (Chariots and horses) rather; put your trust in the Lord. He always arrives on time. In critical moments of your life, God will send you help.",
    "prayer": "Dear Lord send me timely help all my life."
  },
  "19": {
    "topic": "THE LORD IS MY SHEPHERD ",
    "bibleReference": "Psalms 23",
    "text": "A shepherd is someone that tends a flock. He watches over it, looks after it, guides it and ensures that the flock is nourished, supplying it with everything that it needs to grow well and promotes its wellbeing. Psalms 23 likens God to our shepherd. David could easily relate with the phrase, “The Lord is my Shepherd,” because he understood what a shepherd does.\n\nPsalms 23 speaks about the compassion of God. He provides the needs of the sheep of His pastures; He protects us from all forms of danger and steers us along safe paths through life. Much more than what David did to protect his flock, the Lord is able to protect us from all harm. Any one that wants to hurt or harm us would definitely be in battle with the Lord of Host who is strong in battle. This Psalm is all encompassing. It talks about RELATIONSHIP and SUPPLY; REST; REFRESHMENT; HEALING; GUIDANCE; PURPOSE; PROTECTION; FAITHFULNESS; DISCIPLINE and ETERNITY!\n\nWhen you confess the Lord as your shepherd, you are invariably placing your total trust in him, surrendering your will to His will. Any sheep in the flock that does not follow the leading of the shepherd is exposed to the devourer. ",
    "prayer": "Give me the grace to be submissive to your leading in Jesus’ name."
  },
  "20": {
    "topic": "I SHALL FLOURISH",
    "bibleReference": "PSALM 92: 12-15",
    "text": "The word says here that you will flourish. It is settled.  In this family, we will all flourish. To flourish means being at your best. You will be at your best at all times and in all situations. Maritally, you shall be at your best. Financially, you will be at your best. Academically, you will be at your best. In all situations and at all times and no matter the circumstances, you shall be at your best. The entire house shall see your flourishing and give God glory for what He is doing in your life.\n\nIt also means to thrive. For the rest of this year, you shall not wither but thrive.  You shall blossom. It also means to be prosperous. So it is your season. God compares you with the palm tree and the cedar in Lebanon. These two trees flourish in all seasons and whatever the circumstances. It therefore does not matter what is happening around you or in the nation, you will prosper.\n\nIt talks about good health, sound mind and peace all around you.  Nothing shall be missing or destroyed in your life. You shall be great.  In the next few days; we shall be considering some factors relevant to your flourishing.",
    "prayer": "Lord I receive your promises for me. Your promises will never fail in my life in Jesus’ name."
  },
  "21": {
    "topic": "GRATITUDE",
    "bibleReference": "PSALM 147",
    "text": "No matter where you come from or what you have been through, you must realize that you did not get to where you are by yourself. There are loads of people you owe gratitude on your way to where you are today. A man and a woman came together and brought you to this world. You must recognize that without them you would not be here. It is not about whether they were rich or poor. It is not about whether they were nice to you or not. The fact of the matter is that if not for them, you would not be here. Honour them no matter what. Appreciate them no matter what. The Bible says, “Honour your father and mother, as the LORD your God commanded you. Then you will live a long, full life in the land the LORD your God is giving you.” Deuteronomy 5:16 (New Living Translation). \n\nA midwife, a doctor, nurses supported the process of your delivery. Someone taught you to read and write. Someone was patient to teach you the things you know today. Someone built the schools and universities where you were taught. Someone discovered medicines that helped you recover from sickness. Someone thought of every single thing that you possess. You are therefore not a self-made man or woman. You are the product of your environment, of the input of many. Since no one is perfect, it is fair to say that the people in your life’s journey had their weaknesses and handicaps but for the mere fact that they were part of your journey, learn to focus on their strength and sow the gift of gratefulness into their life.\n\nOver two thousand years ago, someone decided that you were too precious to go to hell. Someone loved you so much that when no one else was ready to love you, He loved you enough to give His own life for you. His Father allowed your sin and mine to be placed on His Son. That Father is God. His son is Jesus. They decided that loving you meant that they were ready to make the ultimate sacrifice that you may have life and have it more abundantly. Therefore, as the Son knocks on the door of your heart, do let Him in, accepting what He has done for you and your life will go from glory to glory. Your story will strengthen many generations.",
    "meditation": "List seven personalities you are indebted to for your present level and appreciate God for their lives."
  },
  "22": {
    "topic": "HELP ME TO SERVE YOU O LORD",
    "bibleReference": "Psalm 132:1-18",
    "text": "Many a times, one has the hunger to serve the Lord in a particular manner, place, way or with substance but the means, talent, time or opportunity would just not be there. Look at the Psalmist here. He had a mind to build a house for the Lord but was not opportuned. He had the means; he had the commitment; his love for the Lord was unwaivering. Yet, he did not have the go ahead from the Lord.\n\nThere are also others that may desire to do things in the house of the Lord but lacking the means or the chance. Many wish to be Kingdom Financiers but cannot afford to be. Some wish to sing but do not have the talent. Whatever the case, we must learn a lesson from King David. With all his stature before God, he was not permitted to build the House of God. But he didn’t give up. He went ahead and made the provision for his son, Solomon to build it without much trouble. This teaches us that even if you can’t do certain things. You can enable others to do it. In God’s service, there’s no competition. We complement one another. You may not be in the choir, but you can support by financing equipment. You can do other things. Nobody is useless in the house of the Lord. Just find your place and fit in.",
    "prayer": " /n/n• Lord, I shall not be lacking in my service to You\n\n• Let my Service be acceptable to You, O Lord\n\n• I receive my own cloth of righteousness\n\n• Preserve my generations after me to serve you continuously.\n\n• Let my enemies be clothed with shame."
  },
  "23": {
    "topic": "PERFECT MY PORTION, O LORD",
    "bibleReference": "Psalm 138:1-8",
    "text": "The Psalm for today is one of remembrance and prayer. The Psalmist began on a note of praise and gratitude for the goodness he had received in the past. Hear him:/n/nI will praise you, Lord, with all my heart;\nbefore the “gods” I will sing your praise.\nI will bow down toward your holy temple\nand will praise your name\nfor your unfailing love and your faithfulness,\nfor When I called, you answered me;\nyou greatly emboldened me\n\n.It is good to always remember God’s faithfulness in our life. The times He answered our prayers in the past; how he rescued us at our quarter to shame moments and made us look like champions! When we do these continually, the Lord delights in us and puts fresh testimonies in our mouth. Learn to praise more than ask and you will see God perfecting all that concerns you.",
    "prayer": "\nGo down memory lane and thank God for His past goodness\n• Now commit the present and the future into His hands\n• Pray verse 8 as a loud confession"
  },
  "24": {
    "topic": "DELIVER ME FROM THE WICKED",
    "bibleReference": "Psalm 140:1-13",
    "text": "In our journey as believers, there are people not happy with us. The fact that we are Christians is enough to attract opposition from certain quarters. Some people are not happy because we are happy. They would prefer us to be sorrowful and lacking in joy. Others prefer to be where we are in life and destiny. Some want exactly what we have and believe that eliminating us will be the solution to their lack. They would therefore not hesitate to devise wicked means and evil acts against us if they think that will usher them into their success. Remember King Balak who contracted Balaam to come and curse Israel? Such situations still occur today. You didn’t offend them, yet they will be fighting you in their wickedness. You need to pray. Prayer is the antedote you need to overcome the wicked.",
    "prayer": "\n• Deliver me O LORD from the wicked and violent man\n •Grant not, O LORD the desires of the wicked over me and mine/n• Let burning coals fall upon the wicked and let them fall into the pits they dug for me\n •Let evil hunt the devisers of evil\n• Maintain my cause O LORD"
  },
  "25": {
    "topic": "LET DESTRUCTION COME TO AN END",
    "bibleReference": "Psalm 9:1-20",
    "text": "When one goes through warfare situations, one of the prominent thoughts would be “When will this end?” The situation may appear elongated and overwhelming to the extent that one begins to think God has forgotten you. Relax, God will not forget or forsake. He will come at the nick of time. His timing may differ from yours. But in the end you will discover that God makes things beautiful in his own time.\n\nWe may need to take a cue from the Psalmist here. While still confronted by the enemy, he was giving God upfront praise. He was telling God what he will do “when mine enemies are turned back”. He will be glad and rejoice in the Lord. This is the winning attitude to have in the midst of difficult situations. What you are going through will not end your life. It will not defeat you. You will come out tops in Jesus name.",
    "prayer": "\n• Give God upfront praise\n• Decree an end to destructions in the hand of the enemy; verse 6\n• Make the Lord your refuge in times of trouble; verse 9\n• Forsake me not in times of trouble O LORD\n• Pray for God’s mercy upon your life; verse 13\n• Arise O LORD, let not man prevail over me; verse 19\n• Dear Lord, do in my life what will make nations reverence your name; verse 20"
  },
  "26": {
    "topic": "BE THOU MY HELPER, O LORD",
    "bibleReference": "Psalm 30:1-12",
    "text": "The experience of the Psalmist here is worthy of note and emulation. It is a testimony of victory propelled through strategic prayer and spiritual warfare. He went through a situation with the enemy and it was the Lord that saw him through. The Lord kept him alive that he “should not go down to the pit”. He cried unto God, and received healing. Whenever you are confronted with grave issues, what do you do? Who do you run to for help? The experience of the psalmist here is for our example. Let’s pray the prayers in his testimony.",
    "prayer": "\n•  Pray the prayer of repentance and ask God not to be angry with you; verse 5.\n• Lord lift me up and let not my foes rejoice over me; verse 1.\n• Lord let your favour make my mountain stand strong; verse 7.\n• Dear Lord preserve my life for your praise; verse 9.\n• By your mercy O LORD, be thou my helper; verse 10.\n• Turn my mourning into dancing and gird me with gladness; verse 11\n• Lord, let my glory sing praise to you all my days; verse 12."
  },
  "27": {
    "topic": "DEFEND YOUR INHERITANCE O LORD",
    "bibleReference": "Psalm 79:1-13",
    "text": "This psalm is a prayer of intercession for the nation. The Psalmist is concerned that the heathen have come into the inheritance of the Lord which is the nation of Israel. Whenever the nation is defeated in battle, the obvious conclusion is that God is not with them or that the Lord is angry at their sins. The Psalmist here acknowledges both facts and makes intercession for God’s intervention and deliverance. We too can learn from this in praying for the church and the nation. In doing this, we should identify fully with the Church and/or nation. Remember Daniel? He didn’t separate himself from the nation. He confessed the nation’s sins as if they were personal to him and asked forgiveness! It was then he could make impactful intercession. And God answered him. May the Lord answer our prayers.",
    "prayer": "\n• Father forgive our sins and let your anger be turned away from us; verse 5-6.\n• Let your mercy deal with and remember not our former iniquities; verse 8.\n• Help us for the glory of your name and deliver us from the hands of the enemy. Let them not say, “where is our God?”\n• Deliver us O LORD from appointed death; verse 11.\n• Dear Lord, render reproach to our mockers and oppressors and grant us great deliverance; verse 12-13."
  },
  "28": {
    "topic": "O THAT I MAY DWELL IN YOUR TABERNACLE",
    "bibleReference": "Psalm 84:1-12",
    "text": "Unlike most of the prayer psalms we have considered in this series, our text today is a prayer of dedication and consecration. It is not about what God should do for him. It is not about promotion or deliverance from the hands of the wicked. Rather the Psalmist longs to dwell in the tabernacle of the Lord. This talks about His Presence.\n\nThere comes a time in our walk with God that our uppermost is thirst for his presence. There should be a longing for God for no other reason than for Who He is. We go to him not for what we can get but to just fellowship with him. The singer, Don Moen captures the feeling in his evergreen song:\n\nI just want to be where you are, Dwelling daily in your presence\nI don’t want to worship from afar, Draw me close to where you are\nI wanna be where You are; Dwelling in your Presence\nFeasting at your table; Surrounded by your glory\nIn your presence; That’s where I want to be\nI just want to be with you.\n\nThis should be your heart cry. His presence is superior to any other need. God wants you to dwell with him more than anything else. You got saved so that you can fellowship with him. In his presence come all other things you may be running after. If you catch this, “the Lord will give grace and glory: no good thing will he withhold from them that walk uprightly”; verse 11. Get hold of his presence: it is the height of uprightness and consecration.",
    "meditation": "Verse 10"
  },
  "29": {
    "topic": "LIFT UP YOUR HEAD O YE GATES",
    "bibleReference": "Psalm 24:1-10",
    "text": "Today’s text is one of those classified as Messianic psalms. Psalms in this category speak about the Lord Jesus. Some make prophecies concerning his birth, ministry, death and resurrection and matters incidental thereto. This particular Psalm proclaims the ownership of the Universe and all therein as belonging to the Lord. By this fact, all creation should worship the Lord for who he is. It lists the criteria for doing this: \n\nWho shall ascend into the hill of the Lord? or who shall stand in his holy place? He that hath clean hands, and a pure heart; who hath not lifted up his soul unto vanity, nor sworn deceitfully. He shall receive the blessing from the Lord, and righteousness from the God of his salvation. Verse 3-5.\n\n Holiness and righteousness form the prerequisite of accessing and dwelling in the Presence of the Almighty God. He cannot condone sin. Whoever must come to him must do so with clean hands. We can safely surmise that the gates and barriers in verses 7-10 are barricades of sin, unbelief and unrighteousness standing between us and God. To have access into His Presence, the gates must give way. You want the Lord of hosts to have his way in your life? Remove the barricades “and the King of glory shall come in”. He will dwell with you, fight your battles and deliver unto you what you need to excel in life and destiny.",
    "prayer": "\n• Worship the Almighty One who owns the earth and all therein.\n• Pray the prayer of repentance and rededication.\n• Make my ways right before you o Lord.\n• Command every gate and door standing before you and the Lord to fall down flat.\n• Make my ways prosperous in your presence, O God.\n\n Shalom"
  },
  "30": {
    "topic": "LET YOUR PRESENCE BE WITH ME",
    "bibleReference": "Psalm 46:1-11",
    "text": "Sometimes, as children of God we go through hard and challenging circumstances in life. Such experiences are normal to life. None of the Apostles or the great prophets of old had it any easier. Even Jesus Christ, our Lord and Saviour, had to face tribulations on earth, just for our sake while doing the will of the Father. He was filled with so much grief that his sweat became like drops of blood (Luke 22:44). Simply put, he was overwhelmed with his assignment (his circumstance as at the time) yet, was only interested in performing the will of the Father. This goes to say that it is normal to have challenges in life (John 16:33), however, be not deterred, you will emerge triumphant because the Holy Spirit is with you, and He will never leave you defenseless. See John 16:33.\n\nWhat to do when you are afraid:\n\nCry out to God, He will answer you. In the day when I cried out, You answered me, and made me bold with strength in my soul (Psalm 138:3).\nLet not your heart be troubled. God is our refuge and strength, a very present help in trouble. Therefore we will not fear, though the earth should change, though the mountains shake in the heart of the sea; though its waters roar and foam, though the mountains tremble with its tumult (Psalm 46:1-3).\nPut your Hope in God. But those who hope in the LORD will renew their strength. They will soar on wings like eagles; they will run and not grow weary; they will walk and not be faint (Isaiah 40:31).\n\nMeditate on the Word of God. For everything that was written in the past was written to teach us, so that through the endurance taught in the Scriptures and the encouragement they provide we might have hope (Romans 15:4).\nBe courageous. Even though I walk through the darkest valley, I will fear no evil, for you are with me; your rod and your staff, they comfort me (Psalm 23:4).\n\nNo matter what challenges you come across, you will come out victorious. The HOLY SPIRIT is with you and he is GOD. Remember, He is your able shepherd.",
    "prayer": "I thank you Father in whatever circumstances I find myself, for I know you are with me and will see me through triumphantly."
  }
}
