{
  "1": {
    "topic": "PROFITING",
    "bibleReference": "Isaiah 48:17",
    "text": "Welcome to August. In the Jewish calendar, August is the month of harvest. You have cleared the field; you have sown your seed and now God’s part is coming into play to give you a bountiful harvest. Your harvest shall surpass what you have sown as the Lord is restoring to you the wasted years. In the program of God and by natural laws, one reaps more than what is sown. A grain of corn would yield at least two or more cobs bearing multiples of grains. This is profiting. This month and beyond, you are entering your season of PROFITTING in Jesus mighty name. This month God shall appear big in your case. Joel 2:27. It shall be made manifest that the Lord has given seed to you. The harvest that you shall have shall be uncommon and your profiting shall be evident to all. This month you shall take the old out for the new. You shall have need to enlarge your place because of your bountiful harvest. You shall call in men to help you in the harvest that the Lord is giving you. This month and henceforth, you shall be watered and enriched by God. God himself shall provide for your grain in all ramifications. Your year shall be crowned with God’s goodness and your path shall drip with the Lord’s abundance. Psalm 65:9-13 Because you are the beloved of the Lord, when men would be saying it is a casting down you shall be saying it is a lifting up. Since the mouth of the Lord has declared the month your season of Bountiful harvest, it won’t matter how the situation looks, God shall give you a bountiful harvest. Every of your grain that you sow in faith shall bring forth great harvest. Every of your expectation shall be met for good. Physically and spiritually, you shall harvest bountifully in Jesus' name.",
    "meditation": "Joel 2:23-27"
  },
  "2": {
    "topic": "THE SEARCH FOR WISDOM",
    "bibleReference": "Proverbs 3: 13 - 24",
    "text": "Wisdom is God-given. It is not the result of mere human effort. Wisdom as a precious commodity is profitable to direct. (Ecc: 10:10) if you are poor, you need wisdom to be rich. If you are rich, wisdom is needed to manage your riches. If in difficulty, wisdom offers the way out. Wisdom indeed is indispensable, a precious commodity, more precious than gold or silver. Those who accept her accept her to life eternal while those who reject her do so to their perdition and destruction. How then may we search for wisdom?\n\n 1.Wisdom requires a diligent search. Proverbs 4:7 identifies wisdom as a principal commodity that must be acquired at all costs. Proverbs 2:4. King Solomon demonstrated what this scripture preaches in 1kings3:5-15 by asking for wisdom above all other things\n\n 2.Wisdom must be sought to the accompaniment of understanding. The same scripture advocates that the search for wisdom is futile if not accompanied by understanding. Wisdom is useless in the hands of a fool without understanding.\n\n 3.Wisdom is for the discerning mind. In Proverbs 1 wisdom announces its presence everywhere. It is left for the discerning in mind to discover it.\n\n 4.Wisdom sometimes comes in packages of instructions which must be obeyed- Proverbs 2:1 \n\n 5. A man may benefit from the inexhaustible riches of wisdom through the Holy Spirit, a human agent such as the teacher of the word, pastor prophet or parent.",
    "prayer": "As I give the search for wisdom a pride of place in my life I shall not remain a fool in Jesus name"
  },
  "3": {
    "topic": "THE VALUE OF FELLOWSHIP",
    "bibleReference": "Hebrews 10:25",
    "text": "Man was created a social animal. The first creature of God was not created in isolation but was given a companion. Later God pronounced a decree that completely brought about social beings. It was the decree of “Go ye and multiply” No man is an island. The life of man, makes sense only in the context of others. A professor once lived the life of a recluse. His daily itinerary was from the classroom to the cafeteria where he ate and had refreshments before retiring to his apartment at the end of the day. No one solicited his presence. No one called on him. He had no friends or relatives. And then the recluse professor died. When he died, it was the odour of his putrefying body that drew the attention of neighbours. What does one say about this waste of a life that fails to acknowledge the indispensability of relationship of man towards one another? A life of isolation is not profitable.\n\n It negates the very essence of God. God is a crowd lover. The bible says “where two or three are gathered in his name, He is there in their midst.” The psalmist sings about the love that binds brethren together, (Psalm 133). In Hebrews 10:25, God expressly instructs believers not to forsake the assembly of themselves. A believer in the church of God does not exist in isolation, but is built up with other children of God into a holy habitation of God. Wherever you find yourself, in your neighbourhood, workplace or the church of God the value of interaction cannot be over emphasized. Do not scoff at relationships. That relationship in which you find yourself could be your lifting point.",
    "prayer": "I recognize relationships and I receive the grace to make the best of every God given relationship that comes my way in Jesus Name."
  },
  "4": {
    "topic": "GOD WILL DEAL WELL WITH YOU.",
    "bibleReference": "Genesis 32:1-10",
    "subtext": "“And Jacob said, “O God of my Father Abraham… which said unto me; Return unto thy Country… and I will deal well with thee” Gen 32:9",
    "text": "We are all familiar with the story in today’s passage. After deceiving his father to get his brother’s blessing, Jacob escaped to Laban and dwelt there twenty years or thereabouts. The story itself is not the issue of our study today. Rather it is the phrase in verse 9 above. God told Jacob, “I will deal well with thee”. This is the assurance we heard from God concerning you this season. God will do well with you. The promise covers you, your household, your business, your health, your wealth and all your concerns. There is no need to fear what these times have to offer. The predictions of false prophets and the so-called socio-economic indicators should not scare you. Political pundits should not cause you to panic. Your feelings and what you may be going through today, notwithstanding, the promise of God is that “He will deal well with you”.\n\n When the Lord says it is well, it does not matter who or what says otherwise. God had spoken and his word has an innate ability to perform itself. For the Word of God is quick and powerful and sharper than any two-edged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow and is a discerner of the thoughts and intakes of the heart. Hebrews 4:12. Yes. The word is powerful. It can penetrate any situation; it can change any circumstance in your favour. God backs up his word to perform it. Therefore, we are very confident of the certainty of HIS promise to you; God will deal well with you. Your case is settled. There is no need to panic when others are scared. When you are confronted with unlikely or contrary situations, remember and confess: “God will deal well with me”. No evil shall befall me. All around and all about me shall be good. There will be no sorrow in my camp because God will deal well with me.",
    "prayer": "Lord I believe and receive what you have promised. It is well with me in Jesus’ name."
  },
  "5": {
    "topic": "GOD WILL DEAL WELL WITH YOU II",
    "bibleReference": "Genesis 32: 9-21",
    "text": "Today, we continue our examination of God’s promise to us. He said, “I will deal well with you”.  This is the promise for you and your children. By the reason of this promise, you shall not lose anything that is yours. Beyond your sweat and strategies, the word of God shall prevail. His blessing shall be upon your efforts and there shall be great results. For the remaining days in 2024, you shall not have any anniversary of sorrow. There shall be no evil in your camp. You shall be multiplied by the Almighty God. Consider whatever you have got or achieved so far this year with as just a staff. Like Jacob who crossed the Jordan with nothing but a staff, you will soon become two bands or more. The Lord shall greatly increase your greatness and comfort you on every side. This is a year of successful deliveries. Whatever you are led by God to conceive in your heart, you shall have the capacity to deliver it. Your dreams shall surely come to pass.               “And thou said, I will surely do thee good” vs 12    Dearly beloved, if it is not good, it is not God. If it is not good, then it is not for you.\n\n Don’t expect anything less. It is going to be well with you. God will do you good. You will be helped by God. He knows your frame. He knows you are weak. He knows you are prone to mistakes. He will not allow your weakness or your mistakes to cancel His promise. He will be unusually kind to you in the remaining days of this year and beyond. He will be gracious to you. He will be favourably disposed to you. Go in this might. Don’t be moved by feelings. Move by faith. You shall not be alone. You shall not be naked. Your harvest shall not be wasted. You shall not be wasted. He will be the one to fight your battles. He shall deliver the victory into your hands. Finally, don’t envy anybody, whatever you see in others and you like, God is able to double it for you. All you need is to focus on the One who promised to deal well with you. And all shall be well with you.",
    "meditation": "God shall deal well with me! God shall do me good!"
  },
  "6": {
    "topic": "YOU ARE NOT AN ACCIDENTAL GUEST.",
    "bibleReference": "John 14:1-4",
    "text": "In today’s reading, we have assurances from the Lord Jesus Himself. Firstly, he says not to panic. “Let not your hearts be troubled” What can make your heart to skip concerning the future? Are they the problems rolled over from the last few months? Or the circumstances that seem to make things worse or make the future appear bleak? Or the predictions you have heard that things will get worse? Or your own permutations based on experience? Whatever! The Lord says relax. Let not your hearts be troubled. Believe no other report. Believe only the Lord, His report is the authentic one. And now he had gone ahead and travelled the length and breadth of this latter part of 2024 for you. He has made adequate preparations for your accommodation and sustenance in the remaining days of the year: “In my Father’s house are many mansions; If it were not so, I would have told you. I go to prepare a place for you. vs 2 It is not by accident that you made it thus far. You did not scale through these last seven months by a stroke of luck.\n\n Rather it is by design. God was expecting you. He made adequate preparations for you. He has gone ahead before you to make available those things that will make life comfortable and convenient for you. All you need do is continue to look up to God in faith; hearken to his word and follow his instructions and all shall be well with you. Please note that your father is expecting you. You are not an accidental guest. He is waiting for you with great opportunities. Your doors are waiting; they will open for you. Your wealth is waiting; Ideas will come to you. Destiny helpers are waiting. You will discover them. Some will discover you of their own accord. Mysterious circumstances designed to lift you are also waiting. Miracles that defy human explanations and logic are waiting. Your host is the Lord. He knows you are coming. He is expecting you. And He has made preparations. You shall end this year on a note of triumphant praise.",
    "prayer": "And now Lord, let your promises come to pass without fail in my life"
  },
  "7": {
    "topic": "MAKE YOUR MARK",
    "bibleReference": "2 Kings 5:1-15",
    "text": "Without doubt, you are familiar with the story of Naaman, the Assyrian warrior. He was a successful General by all standards. A subject of envy to friends. He was close to the king and a prominent personality in the corridors of power. There was however an issue in his life that he was struggling with: a big “but” that his might and experience could not erase, he was a leper! But that was not the end of the story. There was the emergence of a young girl who turned the whole story around. Young, but powerful, though small, she was the angel that God used to bring healing and restoration to Naaman, the mighty man of valour. There are some striking attributes about the young Israeli girl. First of all, she identified her purpose in the life of Captain Naaman and his wife. No wonder she made her mark. Her name got into the book of record. You can also make your mark.\n\n Understand why you are in a particular place at a particular time and make your mark. Discover purpose and back it up with pursuit. And watch things change. Secondly, this young girl knew when and how to come in. This is wisdom in manifestation. She understood that there is “when” to come in, and there is also “how” to come in.  These two must go hand in hand. It is not enough to only know when to come in. Always bear in mind that you are on a mission and that must be accomplished wherever you find yourself. You are divinely planted. Make your mark. There is a problem somewhere that must be solved by you. In your hands is the answer to a question. Don’t just merely watch things go the way they are. Don’t leave things the way they are. Let your footprints show on the sand of time. Make your mark.",
    "prayer": "Lord, please help me to be destiny conscious so that I don’t waste the opportunity to be a blessing in Jesus’ name, amen."
  },
  "8": {
    "topic": "EXTRAVAGANT PRAISE ",
    "bibleReference": "Psalm 67:1-end",
    "text": "God is holy, and inhabits the praise of His people. Your praise is a comfortable and conducive accommodation for God. He’s always excited when He hears you sing His praise. Your praise is a key that turns God on. The Bible says He is glorious in holiness and fearful in praises Doing Wonders. So, when praises go up, wonders come down. When praise goes up blessing come down. When your praises reaches up to Him He reaches down to you. When you can’t trace Him, praise Him. When you praise Him you will see Him. He will raise you. Your praise should no longer be safe and polite.\n\n Don’t be too sophisticated to praise God! Don’t be too educated to worship God on your face. Don’t be too gorgeous to prostrate before the One who can kill and make alive. Yes; you have bills to offset. Yes; you have debt to pay. Yes; you have serious issues you are still trusting God for. Yet praise Him for the bills He has paid. Be grateful to Him for those very serious issues He has fixed for you.\n\n If you don’t show appreciation to God for what you have received, you are not qualified to ask Him for another. In this month, praise will be a master key that will unlock your explosion. Let the people praise thee O Lord, then the earth will yield her increase... are you ready for explosive increase? Then give Him extravagant praise.",
    "prayer": "Lord thank you for revealing this truth to me. Please help me to be more conscious of all of your goodness and mercies in my life."
  },
  "9": {
    "topic": "POWER IN THE WORD",
    "bibleReference": "JOHN 1:1-5",
    "text": "The Word of God is unique. In today’s scripture, we are told that the Word has been in the beginning with God. Wait, the Word is God Himself! In other words, whatever God is, the Word is; whatever God can, the Word can. Wherever the Word is, God is also there! These are awesome truths that should change your perception of the Word. Even God himself tells us that He exalts His word above His name.\n\n The Word of God is God personified. The Word contains all the attributes of God, His power, His Grace, His Mercy and His ways. In short, what the Almighty Himself would do were He to be physically present in a given situation, His word would do. In Isaiah 55: 10-11, the Lord says: For as the rain cometh down, and the snow from heaven, and returneth not thilther, but watereth the earth, and maketh it bring forth and bud, that it may give seed to the sower, and bread to the eater: So shall my word be that goeth forth out of my mouth, it shall not return unto me void, but it shall accomplish that which I please, and it shall prosper in the thing whereto I sent it. When the Word goes out, all that God precedes the Word and follows it to bring it to pass.\n\n You cannot separate God from His word. The bible talks so much about the Word of God. Among all the books of the Bible, the Psalms dwell much on the nature and character of the Word of God.\n\n In the Psalms, the 119th chapter is devoted solely to describe the Word. It is variously called the word, statutes, commandments and precepts among others. In the next few days, we shall be studying Psalm 119 for a proper perception of the Word and how to relate to the word to make it bear fruit in our lives. The Psalm is divided into stanzas corresponding with the 22 letters of the Hebrew alphabet and each speaks something specific about the Word. Let’s explore together.",
    "meditation": "Hebrews 11:3"
  },
  "10": {
    "topic": "AN UNDEFILED LIFE",
    "bibleReference": "Psalm 119:1-8",
    "text": "We live in an age and time where holiness, righteousness, uprightness and every word that represents right living no longer carry weight. There was a period where simply being called a “Christian” infers that you are upright, and that probably got you the job. But times have changed and this no longer applies because what is wrong is now the right way of living. It has become so bad that you might even be mocked for claiming to be a Christian in a working environment.\n\n The bible clearly states here that those who will enjoy the blessings of the Lord are those who walk according to the leading and guidance of God’s word, those who keep His principles and flee every appearance of evil. We have everything to gain by obeying God’s commandments, and carrying out every instruction He gives us.\n\n He has taken that journey already before we started, hence He knows the way. God’s master plan for our lives are of good and not evil to bring us to a glorious end. In achieving this, He has given us the Word as the manual of life, we are to use it as a road map to getting to the glorious destination He has in store for us.",
    "point to note": "When Instructions are followed, the chances of successful living are greatly increased!"
  },
  "11": {
    "topic": "OVERCOMING TEMPTATIONS",
    "bibleReference": "PSALM 119:9-16",
    "text": "Joseph was a young man with a great future ahead of him. He was loved by his master and his master put him in charge of all he had, all except his wife. As much as Joseph loved God, that never meant he would not have to face temptations and trials, and this presented itself in the form of his Master, Potiphar’s wife. He begged Joseph to sleep with her. And that was probably a tempting offer for such a man. He had all the power and now he was being presented on the platter of gold the only thing he didn’t have access to.\n\n Temptations will always present itself to us in different ways and forms, the only sure way of overcoming is by living according to God’s word, making God your priority, keeping His commands. Joseph valued God’s word so much that he said to Potiphar’s wife; how can I do such wickedness and sin against God.\n\n It is quite interesting that he didn’t say “how can I sin against my master”, He revered God much more than the person who had put him on that job. God’s ultimate desire for us is to please Him by living right, and this is only possible when our minds are filled with the right stuff. Battles of life are won or lost in the mind. The bible also says out of the abundance of the heart, the mind speaks. The Word is our immunity against the virus of sin. Load yourself with God’s word and sin won’t have space to grow.",
    "meditation": "Sin will either keep you away from God’s word, or God’s word will keep you away from sin!"
  },
  "12": {
    "topic": "INSPIRED BY THE MOST HIGH",
    "bibleReference": "Psalm 119: 17-24",
    "text": "There is an adage that goes: He who asks does not miss his way. It is amazing how much time we waste trying to figure our way around in life simply because we refuse to ask for direction. Most times, the fastest way to get to a destination is by asking for direction, and who best to ask from if not God especially when it comes to life matters. \n\n It is quite logical since He is the ancient of days; which implies He has been for millions/billions of years before we even existed, and it’s even more amazing that He remains relevant in our time. When our eyes are opened to see, it brings illumination, speed, direction, fulfilment, joy, insight, accomplishment and so on to our lives. Won’t it be amazing if you already know in detail how to get to that glorious destination God has in store for you? Those dreams and aspirations; that vision etc will be accomplished with ease. All these are possible if only we choose to ask Him for direction, and more much make ourselves open to be inspired by Him. \n\n However, it is not enough to be inspired, or to be on the right track to success. Staying on that path is equally important; and this is possible only when we remain humble before Him. Inside the Word is the direction you need to your destiny.\n\n God resists the proud and gives grace to the humble. As often as possible it is important to assess our lives to be sure that we are not living an arrogant kind of life because that is the path to destruction.",
    "prayer": "Lord, please illuminate my mind, give me directions in life, help me not to take the wrong steps, and destroy every spirit of pride in me. Amen"
  },
  "13": {
    "topic": "UNWAIVERING TRUST",
    "bibleReference": "Psalm 119:25-32",
    "text": "One of the most difficult things you can tell an adult to do is trust you. You can ask a little child to jump from a story building claiming you will catch him, and he probably will, because it is natural for him to trust you, more so as he sees you are bigger than him. His mind automatically calculates that this adult who carries me is big enough to catch/hold me.\n\n However, if that same child grows to be an adult and you being the same adult asks him to jump, he’ll probably laugh at you, maybe even suggest you swap positions so you jump while he catches you. Why is it so easy to trust someone and jump when we are children simply because that person is bigger than us, but we find it so difficult to trust God who is unimaginably bigger than us when He says to us; Jump, I will hold you! When we learn to place our absolute trust in God and his statues, He takes up the responsibility of ensuring we are not let down or put to shame. The Psalmist says “I hold fast to your statutes, O Lord, do not let me be put to shame’’.\n\n You need to learn to put your absolute trust in God, to the point where you feel, if God doesn’t catch me, if God doesn’t intervene, if God doesn’t fix this, then no other person can. Whatever the Word says God will do is what he will do. Trust the word. This is faith. When God sees our level of faith, He is automatically moved to coming to our aid like a Father catching his child as His word says “I will never leave you nor forsake you”",
    "prayer": "Lord, teach me to put my absolute trust in you. Help me to grow in faith realizing that if you do not help me, no other person can! "
  },
  "14": {
    "topic": "POWER OVER GREED",
    "bibleReference": "Psalm 119: 33-40",
    "text": "The process of being taught isn’t often pleasant; it requires a level of commitment and not mere words, but the way of applying them to oneself. God gives us the right understanding through revelation in His word when we allow the spirit of wisdom in our hearts. God created us in His image and likeness and desires we walk according to his precepts and guidance.\n\n Therefore, God puts his Spirit within us. The Psalmist prays against the sin of greed and having or showing a strong desire especially for material possessions. The problem isn’t in being blessed with these possessions, but rather in being greedy.\n\n Those that would have the love of God rooted in them, must get the love of the world rooted out; for the friendship of the world is enmity with God. When we enjoy the sweetness of God's teachings and principles, it will make us long for more acquaintance with these teachings and it gives us a better chance at a glorious and colorful future. What God has started, He is committed to finish, when we give God access to every part of our lives, He makes it His responsibility to perfect all that concerns us.",
    "prayer": "Lord, I give you the driver’s seat of my life, that you lead and guide me every step of the way."
  },
  "15": {
    "topic": "FREEDOM: A FRUIT OF OBEDIENCE",
    "bibleReference": "Psalm 119:41-48",
    "text": "Obedience is better than sacrifice. God has more delight in our obeying his words, and instructions, much more than in our sacrificing or giving back to Him. Saul claimed to have obeyed the voice of the Lord by going the way which the Lord sent him, and even totally destroyed the people of Amalekites, but then, the people with him didn’t.\n\n They did not destroy the resources or livestock and took them along with them; which was against the instructions God had given. Saul did most of what God said, in fact he did the major part, but he and his people missed it for not following through on every instruction given by God. Hence Samuel reminded him of the fact that God cares less about offerings and sacrifices, but what’s more important is obeying every word and instruction He gives.\n\n The truth is that God is more lenient with us in our age than He was in the times of old. However, one thing remains; He delights in us obeying every single instruction He gives. The psalmist resolves to keep God's law, in a constant course of obedience, without backsliding. The service of sin is slavery; the service of God is Freedom. There is no true happiness, but in keeping God’s law.",
    "prayer": "Dear God, help me never to be afraid or ashamed to do your will, to follow your instructions and to own your truths."
  },
  "16": {
    "topic": "HE NEVER FAILS",
    "bibleReference": "Psalm 119:49-56",
    "text": "Horatio Spafford (1828-1888) was a wealthy Chicago lawyer with a thriving legal practice, a beautiful home, a wife, four daughters and a son. He was also a devout Christian and faithful student of the Scriptures. At the very height of his financial and professional success, Horatio and his wife Anna suffered the tragic loss of their young son.\n\n Shortly thereafter on October 8, 1871, the Great Chicago Fire destroyed almost every real estate investment that Spafford had. In 1873, Spafford scheduled a boat trip to Europe in order to give his wife and daughters a much-needed vacation and time to recover from the tragedy. Spafford sent his wife and daughters ahead of him while he remained in Chicago to take care of some unexpected last-minute business. Several days later he received notice that his family's ship had encountered a collision.\n\n All four of his daughters drowned; only his wife had survived. With a heavy heart, Spafford boarded a boat that would take him to his grieving Anna in England. It was on this trip that he penned those now famous words, When sorrow like sea billows roll; it is well, it is well with my soul.\n\n God never said we will never go through trials and difficult moments in life, however one thing He has assured us of is that when going through all these, He is there with us. God’s word speaks comfort in affliction. If, through grace, it makes us holy, there is enough in it to make us easy, in all conditions. In the season of affliction, and in the silent hours of the night, we must remember the name of the Lord and endeavor to keep his law!",
    "prayer": "Grant me the grace and strength to make it through difficult moments in life."
  },
  "17": {
    "topic": "GODLY INHERITANCE",
    "bibleReference": "Psalm 119: 57-64",
    "text": "Others place their happiness in the wealth and honours of this world. Their portion is in this life; they look no further; they desire no more; these are their good things. But true and sanctified believers take the Lord for the portion of their inheritance, and nothing less will satisfy them.\n\n David prayed with his whole heart, knowing how to value the blessing he prayed for: he desired the mercy promised, and depended on the promise for it. He turned from by-paths, and returned to God's testimonies. He further made the law of God his rule; I have said that I would keep thy words; and what I have said by thy grace I will do, and will abide by it to the end. God’s desire is we run our life based on his word, every step, every decision, every action should be governed by what He says. This doesn’t take away the fact that sin will attempt to creep in, but when we are under convictions of sin we must strike while the iron is hot, and not think to defer the prosecution of it to a more convenient season.\n\n No care or grief should take away God's word out of our minds, or hinder the comfort it bestows. There is no situation on earth in which a believer has no cause to be thankful, and we should be more earnest in prayer, that our hearts may be filled with his mercy, grace, and peace.",
    "prayer": "Lord, I hide your word in my heart to live by it, please order my steps in your word that I may live above sin."
  },
  "18": {
    "topic": "IF GOD WERE MAN",
    "bibleReference": "Psalm 119:65-72",
    "text": "Why do bad things happen to good people? This is a question that dwells in our hearts a lot of times, especially when we go through difficult moments in life. We wonder why it has to be this way. What we need to remember often is God has dealt with us better than we deserve; and all in love, and for our good.\n\n David sinned against God and he immediately chose the option to be dealt by God rather than by man, he was wise enough to know that if man were to be God over him, he would have been destroyed already, and he was quick to make a thankful acknowledgement of God’s gracious dealings with him always. However, when God deals with us, we must realize He has dealt with us better than we deserve.\n\n If God were to mark iniquities, who will stand? David goes on to ask for divine instruction. We must learn to pray often to God to grant us a sound mind that we may have our spiritual senses exercised. We tend to wander from God sometimes. We should leave our concerns to the disposal of God, seeing we know not what is good for us. We must be humble enough to ask and seek His face; the proud are full of the world, and its wealth and pleasures; these make them senseless, insecure, and stupid.",
    "prayer": "Dear Lord, please continually hide me under your covering, teach me to number my days as I continually thank You for being God in my life."
  },
  "19": {
    "topic": "PERFECT GOD, IMPERFECT ME!",
    "bibleReference": "Psalm 119:73-80",
    "text": "God formed and created us in His image and likeness. He made us ultimately to serve him, to worship him, to have a relationship with him, and enjoy him; but by sin we have made ourselves unfit to serve him, and to enjoy him. It is our responsibility to continually beseech him, by the help of the Holy Spirit, to give us understanding to help us walk right and live right with him, to maintain that relationship and access to his throne room.\n\n The comforts some have in God should be a matter of joy to others. But it is easy to own, that God's judgments are right, until it comes to be our own case. All supports under affliction must come from mercy and compassion. The mercies of God are tender mercies; they are new every morning; the mercies of a father, the compassion of a mother to her son.\n\n They come to us when we are not able to go to them; we are unable to afford it. The psalmist could go on in the way of his duty, and find comfort in it. He valued the good will of saints, and was desirous to keep up his communion with them. Soundness of heart signifies sincerity in dependence on God, and devotedness to him.",
    "prayer": "Lord, I desire to be more and more every day, please make me an image of you here on earth, and help me walk right before you."
  },
  "20": {
    "topic": "OUR HELP AT THE BREAKING POINT",
    "bibleReference": "Psalm 119:81-88",
    "text": "When life throws its punches at us, it hardly cares about our age, status, class or connection. And at these phases of our lives, it is easy to throw in the towel, to give up, and to even question the existence of God.\n\n David sought deliverance from his sins, his foes, and his fears. Hope deferred him; his eyes failed by looking out for this expected salvation. But when the eyes fail, yet faith must not. His affliction was great. He was considered a great man, a great ruler by all standards; He had everything at his beckoning, yet he was faced with a difficult situation.\n\n We must ever be mindful of God's statutes. The days of the believer's mourning shall be ended; they are but for a moment, compared with eternal happiness. Weeping may endure for a night, but joy comes in the morning. His enemies used craft as well as power for his ruin, in contempt of the law of God. The commandments of God are true and faithful and they guide us in the path of peace and safety.\n\n We may best expect help from God when, like our Master, we do well and suffer for it. We should depend upon the grace of God for strength to do every good work. The surest token of God's good-will toward us, is his good work in us.",
    "prayer": "Lord help me to remember that you will never leave me nor forsake me, and I receive the grace to make it through difficult moments life brings my way and come out victorious."
  },
  "21": {
    "topic": "GOD’S WORDS ARE UNCHANGEABLE",
    "bibleReference": "Psalm 119:89-96",
    "text": "The psalmist acknowledges the unchangeability of the word of God and of all his counsels. All flesh is like grass; here today and gone tomorrow, but God’s word is everlasting, it endures forever.\n\n God said regarding His word: heaven and earth might pass away, but not one jot of my word will go unfulfilled. What has God said regarding your life that appears as if it won’t come to pass, as long as it is God who said it, you can be rest assured that His word will surely come to pass. It might appear like it is taking forever, but the assurance we have is that God’s word never fails.\n\n Knowing what God has said regarding our lives doesn’t give us the liberty to become lazy. It is important to remember God’s precepts and instructions and to walk by them, applying them to our every day life. The best evidence of our love for God and his word is to carry it in our hearts and never forget it, and where possible, make the Bible a pleasant companion at all times; for God’s word is the roadmap of life.\n\n The psalmist had seen the fullness of the word of God, and its sufficiency. The word of the Lord reaches to all cases, to all times. It will take us from all confidence in man, or in our own wisdom, strength, and righteousness, and instead help us to put our absolute trust in God.",
    "prayer": ": Your word have I hidden in my heart that I might not sin against you, please cause your unchangeable word to continually grow in my heart."
  },
  "22": {
    "topic": "WISDOM FOR LIVING",
    "bibleReference": "Psalm 119:97-104",
    "text": "Where your treasure is, there will your heart be. What you love, you tend to think more about. The ultimate treasure we can desire is true wisdom. All true wisdom is from God. A good man carries his Bible with him, if not in his hands, yet in his head and in his heart. By meditating on God's testimonies, we understand more than our teachers, when we understand our own hearts.\n\n The written word is a surer guide to heaven, than all the fathers, the teachers, and ancients of the church. We cannot, with any comfort or boldness, attend God in holy duties, while under guilt, or in any by-way. It was Divine grace in his heart that enabled the psalmist to receive these instructions. The soul has its tastes as well as the body. Our desire for the word of God should be greatest. What you feed your mind with determines what you get from life.\n\n Our aim should be feeding our minds and souls with the word of God. This in turn ensures we live a Christ-like and purposeful life. The way of sin is a wrong way; and the more understanding we get by the precepts of God, the more rooted will be our hatred of sin; and the more ready we are in the Scriptures, the better furnished we are with answers to temptation.",
    "prayer": "Dear Lord, please continually fuel my thirst and hunger for your word, that I might live like a god on earth, and I might have true wisdom all the days of my life."
  },
  "23": {
    "topic": "HE WILL DIRECT MY PATH",
    "bibleReference": "Psalm 119: 105-112",
    "text": "God’s word literally directs us in our everyday work and life. His word is the manual we require to navigate the hard terrain called life, and a dark place indeed the world would be without the word. What keeps the lamp burning is the oil of the spirit of God. \n\n This needs to be continually refreshed, as a light to direct us in the choice of our way, and the steps we take in that way. Aside from the lamp directing us. The lamp also helps us discover more about God and ourselves, that which otherwise we could not have known; it shows us what is amiss, and could be potentially dangerous; it directs us in our work and way; ensuring we stay on the right path and right course.Keeping God's commands is equally as important. Keeping His word ensures sin has no space to thrive in our lives as light and darkness cannot be in the same place.\n\n David was often afflicted; but with longing desires to become more holy, he offered up daily prayers for quickening grace. He was quick to realize that grace was very important if he would have a chance to make it through life especially with all that surrounded him. God’s grace makes up for our inabilities and shortcomings, and His grace is freely given; all God expects of us is we humbly approach his throne room and ask for grace.",
    "prayer": "I cast all my cares and burdens on you, I lay my burdens at your feet, and I embrace your grace to lead and direct me along the way."
  },
  "24": {
    "topic": "FOCUS",
    "bibleReference": "Psalm 119: 113-120",
    "text": "The psalmist here is a man of a single mind; he loves the Lord and his law. This means that he is completely focused on God, and his walk with God. His love for God and his word allows him to concentrate on what's most important in keeping us stable through our journey of life. The life of a double-minded man lacks focus, and is therefore shrouded in doubt and uncertainty, and he becomes overwhelmed by the issues of life. A focused man avoids every form of distraction on his way because he realizes this could lead to his downfall.\n\n Anyone who will win the race of life cannot be focused on his or her critics; neither can he or her be focused on their fans. Rather their ultimate focus should and must be on the goal that is set ahead of them. “Looking unto Jesus the author and finisher of our faith; who for the joy that was set before him endured the cross, despising the shame, and is set down at the right hand of the throne of God”. Jesus should be our perfect example, he went through a lot of pain, and could easily have given up, but he saw the end from the beginning and he stayed focused on that; at the end he got enthroned and at the same time gave us the ultimate gift; Salvation!",
    "prayer": "I come against every distraction that might want to derail me from God’s ultimate goal and plans for my life. I receive grace to stay on course and finish strong!"
  },
  "25": {
    "topic": "A LONELY PLACE",
    "bibleReference": "Psalm 119:121-128",
    "text": "Often in life we go through challenges and down times that make us very vulnerable where we cry out to God. These are times we have followed the word of the Lord and every instruction He lays down for us, and things still don't seem to work out accordingly. \n\n It seems like our enemies are gaining, growing and are going to win over us. It is very important to confess to the Lord that we have nobody else but him. Even though he sees deep into our heart, he knows what we are thinking per time; he knows our action before we take them! However, he wants us to continually confess from our very lips that we only trust in him and him alone. It is key that we do not cut corners in these moments and trying times of life. \n\n Honesty remains the best policy; honesty to God and to people around us. Remember also tough moments don’t last, tough people do. What is sure and guarantees our safety and making it through in these moments is remaining connected to God and his word. As long as we stay connected, we are rest assured that he will pull us through and out of these unpleasant situation life brings.",
    "prayer": "I place my hands in your hands lord, please don’t let me slip out of your grace and covering over my life; help me to remember that whatever I’m going through right now is only for a season, the sun will shine again."
  },
  "26": {
    "topic": "A FULL PICTURE",
    "bibleReference": "Psalm 119:129-136",
    "text": "The word of God gives us amazing discoveries of God and our world. The Scriptures show us what we were, what we are, and what we shall be. They show us the mercy and the justice of the Lord, the joys of heaven, and the pains of hell. Thus, they give to the simple, in a few words, the understanding of those matters, which philosophers for ages sought in vain. \n\n The great use for which the word of God was intended, to give light, that is, to give understanding, to give us to understand that which will be of use to us in our travels through this world; and it is the outward and ordinary means by which the Spirit of God enlightens the understanding of all that are sanctified. God's testimonies are not only wonderful for the greatness of them, but also useful, as a light in a dark place. \n\n David also prays that he might live a quiet and peaceable life, and might not be harassed by his oppressors: Deliver me from the oppression of man-man, whom God can control, and whose power is limited . Let them know themselves to be but men (Ps. 9:20), and let me be delivered out of the hands of unreasonable men.'",
    "prayer": "Lord help me understand the full essence of life, and to realize that you are involved in every sphere of my life"
  },
  "27": {
    "topic": "GOD CAN’T LIE",
    "bibleReference": "Psalm 119:137-144",
    "text": "One thing that remains sure is that God cannot lie. If he calls a thing white, even if it were black before, it has to change to white simply because God cannot lie. His word must come to pass. God never did, and never can do wrong to any. The promises are faithfully performed by Him that made them. Zeal against sin should constrain us to do what we can against it.\n\n Our love to the word of God is evidence of our love to God, because it is designed to make us partake his holiness. Men's real Excellency always makes them low in their own eyes. When we are small and despised, we have the more need to remember God's precepts, that we may have them to support us.\n\n The law of God is the truth, the standard of holiness, the rule of happiness; but the obedience of Christ alone justifies the believer. There are delights in the word of God, which the saints often most sweetly enjoy when in trouble and anguish. This is life eternal, to know God and Jesus Christ whom he has sent, John 17:3. May I live the life of faith and grace here, and be removed to the life of glory hereafter.",
    "prayer": "May I live the life of faith and grace here, and be removed to the life of glory hereafter."
  },
  "28": {
    "topic": "HE LIVES IN YOU",
    "bibleReference": "Psalm 119:145-152",
    "text": "David's good prayers, by which he sought to God for mercy are mentioned here, not as boasting of them, or trusting to any merit in them, but reflecting upon them with comfort, that he had taken the appointed way to comfort. Supplications with the whole heart are presented only by those who desire God's salvation, and who love his commandments. Where will a child go without the directions/leading of his father? Save me from my sins, my corruptions, my temptations, all the hindrances in my way, that I may keep thy testimonies. \n\n Christians who enjoy health, should not suffer the early hours of the morning to glide away unimproved. Hope in God's word encourages us to continue in prayer. It is better to take time from sleep, than not to find time for prayer. Our prayer life is essential to our spiritual growth. We have access to God at all hours; and if our first thoughts in the morning are of God, they will help to keep us in his fear all the day long. God knows what we need and what is good for us, and will quicken us. \n\n As long as we are committed to God and walk in his ways, when trouble is near, we have the assurance that God is near. He is never far from us. He is omnipresent. ",
    "prayer": "Let your presence never depart from me, may I live my life with the consciousness that you are always there with me, and may all my actions be guided by you."
  },
  "29": {
    "topic": "COMFORT IN TIMES OF DISTRESS",
    "bibleReference": "Psalm 119:153-160",
    "text": "David has an eye for God's pity, and prays, 'Consider my affliction; take it into thy thoughts, and all the circumstances of it, and sit not by as one unconcerned.' God is never unmindful of his people's afflictions, but he will have us to put him in remembrance. The closer we cleave to the word of God, both as our rule and as our stay, the more assurance we have of deliverance. Christ is the Advocate of his people, their Redeemer.\n\n Those who were quickened by his Spirit and grace, when they were dead in trespasses and sins, often need to have the work of grace revived in them, according to the word of promise. God's mercies are tender; they are a fountain that can never be exhausted. The psalmist begs for God's reviving, quickening grace.\n\n A man who is steady in the way of his duty, though he may have many enemies, needs to fear none. Those that hate sin truly, hate it as sin, as a transgression of the law of God, and a breaking of his word. Our obedience is only pleasing to God, and pleasant to ourselves, when it comes from a principle of love. All, in every age, who receive God's word in faith and love, find every saying in it faithful. ",
    "prayer": "I trust your word, I believe all you say, and I receive help and comfort in the difficult moments of my life."
  },
  "30": {
    "topic": "STANDING FOR RIGHTEOUSNESS",
    "bibleReference": "Psalm 119:161-168",
    "text": "On your Christian journey, please note that many may come against you, but your focus should be on God and you should gladly face human persecution instead of facing God’s discipline for being disobedient. Those whose hearts stand in awe of God's word, will rather endure the wrath of man, than break the law of God. By the word of God, we are unspeakable gainers.\n\n Every man hates to have a lie told him, but we should more hate telling a lie! By the latter we give an affront to God. The more we see the beauty of truth, the more we shall see the hateful deformity of a lie.\n\n We are to praise God even in the midst of afflictions; through grace we get good from them. Those that love the world have great vexation, for it does not answer what they expect; those that love God's word have great peace, for it outdoes what they expect. Those, in whom this holy love reigns, will not perplex themselves with needless scruples, or take offence at their brethren.\n\n Our love to the word of God must subdue our lusts, and root out carnal affections: we must make heart work of it, or we make nothing of it. We must keep the commandments of God by obedience to them, and his promises by reliance on them. Never forget; God’s eyes are on us at all times.",
    "prayer": "Team me to hide your word in my heart that I will not sin against you."
  },
  "31": {
    "topic": "A RELATIONSHIP THAT WORKS",
    "bibleReference": "Psalm 119:169-176",
    "text": "We should always have a desire in our heart to build a higher spiritual relationship with God. We should always seek to have a discerning mind, so that we can be comforted in the knowledge of God's presence in our life, regardless of what is happening around us.\n\n Imagine being on a level that you are so connected to God, so much that you know when God is there, even when it 'appears' as if he is not. Having this deep connection requires the utmost level of commitment to God's love and his law, and following it day and night.\n\n Having a knowledge of God's presence gives a peace about his involvement in your life no matter what you might be going through. The psalmist desired grace and strength to lift up his prayers, and that the Lord would receive and notice them. He desired to know more of God in Christ; to know more of the doctrines of the word, and the duties of religion.\n\n We should always make the word of God the rule of our discourse, so as never to transgress it by sinful speaking, or sinful silence. Seek me, that is, find me; for God never seeks in vain. Sin pushes us away from God, He will always desire a relationship with us. We must do all to grow that relationship",
    "prayer": "Let me live that I may praise you, and may your laws sustain me. "
  }
}
